chalupec/nRF9160_Examples/mqtt_working/src/main.c
	// Calculate RMS
	int32_t mean_square = *sum_squares / RMS_BUFFER_SIZE;
	return (int32_t)sqrt((double)mean_square);
}

void circular_buffer_init(void)
{
	buff_head = 0;
	circ_buff_overflow = 1;
	clear_buffer(circ_buff_ch0, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch1, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch2, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch3, CRCLR_BUFF_SIZE);
}

uint16_t circular_buffer_add_value(int16_t value0, int16_t value1, int16_t value2, int16_t value3)
{
	if (buff_head < CRCLR_BUFF_SIZE)
	{
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	else
	{
		buff_head = 0;
		circ_buff_overflow = 1;
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	return (buff_head);
}

// Clears a buffer of int16_t values
void clear_buffer(int16_t *buffer, size_t length)
{
	memset(buffer, 0, length * sizeof(int16_t));
}

void saturate_channel_values(void)
{
	if (ch0_off_value > 32750)
	{
		ch0_off_value = 32750;
	}
	if (ch0_off_value < -32750)
	{
		ch0_off_value = -32750;
	}

	if (ch1_off_value > 32750)
	{
		ch1_off_value = 32750;
	}
	if (ch1_off_value < -32750)
	{
		ch1_off_value = -32750;
	}

	if (ch2_off_value > 32750)
	{
		ch2_off_value = 32750;
	}
	if (ch2_off_value < -32750)
	{
		ch2_off_value = -32750;
	}

	if (ch3_off_value > 32750)
	{
		ch3_off_value = 32750;
	}
	if (ch3_off_value < -32750)
	{
		ch3_off_value = -32750;
	}
}

void get_time_procedure(void)
{
	int err = date_time_update_async(NULL);
	if (err)
	{
		printk("date_time_update_async error: %d\n", err);
	}

	struct tm timeinfo;
	int64_t unix_time_ms;

	if (date_time_now(&unix_time_ms))
	{
		printk("Failed to get time\n");
		return;
	}

	time_t unix_time_s = unix_time_ms / 1000;

	record_unix_time_s = unix_time_ms / 1000;

	gmtime_r(&unix_time_s, &timeinfo);

	printk("Current UTC time: %s", asctime(&timeinfo));
}

int main(void)
{
	int err;

	uint32_t connect_attempt = 0;

	uint32_t record_cnt = 1780;

	nrfx_err_t status;
	(void)status;

	k_sleep(K_MSEC(500));
	printk("\nSAMPLE APP STARTS\n");
	k_sleep(K_MSEC(500));

#if defined(__ZEPHYR__)
	IRQ_CONNECT(NRFX_IRQ_NUMBER_GET(NRF_TIMER_INST_GET(TIMER_INST_IDX)), IRQ_PRIO_LOWEST, NRFX_TIMER_INST_HANDLER_GET(TIMER_INST_IDX), 0, 0);
#endif

	k_sleep(K_MSEC(500));
	printk("SPIM INIT\n");
	k_sleep(K_MSEC(500));

	nrfx_spim_config_t spim_config = NRFX_SPIM_DEFAULT_CONFIG(SCK_PIN,
															  MOSI_PIN,
															  MISO_PIN,
															  MEM_CS_PIN);

	spim_config.frequency = 8000000;
	//spim_config.irq_priority   = 2;

	status = nrfx_spim_init(&spim_inst, &spim_config, NULL, NULL);
	// NRFX_ASSERT(status == NRFX_SUCCESS);

	k_sleep(K_MSEC(500));
	printk("SPIM INIT finished\n");
	k_sleep(K_MSEC(500));

	uint8_t wr_buff[32];
	uint8_t rd_buff[32];
	uint8_t cntradd = 0;

	uint32_t demowrite = 160000;
	int16_t smpl = 0;
	uint32_t adrrr = 0;
	uint8_t cntr = 0;
	while (demowrite--)
	{

		if (smpl == 5000)
		{
			smpl = -5000;
		}
		cntr = 0;
		wr_buff[cntr++] = smpl >> 8;
		wr_buff[cntr++] = smpl & 0xff;
		wr_buff[cntr++] = smpl >> 8;
		wr_buff[cntr++] = smpl & 0xff;
		wr_buff[cntr++] = smpl >> 8;
		wr_buff[cntr++] = smpl & 0xff;
		wr_buff[cntr++] = smpl >> 8;
		wr_buff[cntr++] = smpl & 0xff;
		cntr = 0;
		//	LOG_INF("%d\t%d\t%d\t%d\t %d\t%d\t%d\t%d", wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++],wr_buff[cntr++]);

		FLASH_MEMORY_WRITE_BYTE_ARRAY(adrrr, wr_buff, 8);
		//	k_msleep(2000);
		adrrr = adrrr + 8;
		smpl++;
	}

	k_msleep(2);

	demowrite = 50000;
	adrrr = 0;
	int16_t res[4] = {0};
	smpl = 0;
	uint16_t errcnt = 0;
	while (demowrite--)
	{
		FLASH_MEMORY_READ_DATA(adrrr, rd_buff, 8);
		adrrr = adrrr + 8;
		cntr = 0;
		res[0] = (int16_t)rd_buff[cntr++] << 8;
		res[0] |= rd_buff[cntr++] & 0xff;

		res[1] = (int16_t)rd_buff[cntr++] << 8;
		res[1] |= rd_buff[cntr++] & 0xff;

		res[2] = (int16_t)rd_buff[cntr++] << 8;
		res[2] |= rd_buff[cntr++] & 0xff;

		res[3] = (int16_t)rd_buff[cntr++] << 8;
		res[3] |= rd_buff[cntr++] & 0xff;

		if (smpl == 5000)
		{
			smpl = -5000;
		}

		if ((smpl == res[0]) && (smpl == res[1]) && (smpl == res[2]) && (smpl == res[3]))
		{
		}
		else
		{
			errcnt++;
		}

		smpl++;

		// LOG_INF("%d\t%d\t%d\t%d", res[0], res[1], res[2], res[3]);

		// k_msleep(3);
	}

	LOG_INF("error samples 8rd  count %d", errcnt);

	k_msleep(200);



	demowrite = 20000;
	adrrr = 0;
	smpl = 0;
	errcnt = 0;
	int16_t ress[16]={0};
	uint16_t ancnt=0;
	while (demowrite--)
	{
		FLASH_MEMORY_READ_DATA(adrrr, rd_buff, 32);



		adrrr = adrrr + 32;
		cntr = 0;
		ancnt=0;
		while (ancnt<16) {
			ress[ancnt] = (int16_t)rd_buff[cntr++] << 8;
			ress[ancnt++] |= rd_buff[cntr++] & 0xff;
		}

	

	    if (smpl == 5000)
		{
			smpl = -5000;
		}
		

		if ((smpl == ress[0]) && (smpl == ress[1]) && (smpl == ress[2]) && (smpl == ress[3]))
		{
		}
		else
		{
			errcnt++;
		}
		smpl++;


		if ((smpl == ress[4]) && (smpl == ress[5]) && (smpl == ress[6]) && (smpl == ress[7]))
		{
		}
		else
		{
			errcnt++;
		}
		smpl++;


	    if ((smpl == ress[8]) && (smpl == ress[9]) && (smpl == ress[10]) && (smpl == ress[11]))
		{
		}
		else
		{
			errcnt++;
		}
		smpl++;


		if ((smpl == ress[12]) && (smpl == ress[13]) && (smpl == ress[14]) && (smpl == ress[15]))
		{
		}
		else
		{
			errcnt++;
		}
		smpl++;
		
	//	ancnt=0;
	//	while (ancnt<16) {
	//		LOG_INF("%d\t%d\t%d\t%d", ress[ancnt++], ress[ancnt++], ress[ancnt++], ress[ancnt++]);
	//		k_msleep(3);
	//	}

		



	}



	LOG_INF("error samples 32 rd count %d", errcnt);

	k_msleep(200);


	while (0)
	{
		k_msleep(20);
	};


























//	while (1)
//	{
//		k_msleep(20);
//	};

	//	flash_address_write = 0;
	//	uint16_t wrtsmp = 20000;
	//	int16_t scnt = 0;
	//	while (wrtsmp--)
	//	{
	//		scnt++;
	//
	//		if (scnt == 4000)
	//		{
	//			scnt = -4000;
	//		}
	//		flash_write_buffer_byte[0] = scnt >> 8;
	//		flash_write_buffer_byte[1] = scnt & 0xff;
	//
	//		flash_write_buffer_byte[2] = scnt >> 8;
	//		flash_write_buffer_byte[3] = scnt & 0xff;
	//
	//		flash_write_buffer_byte[4] = scnt >> 8;
	//		flash_write_buffer_byte[5] = scnt & 0xff;
	//
	//		flash_write_buffer_byte[6] = scnt >> 8;
	//		flash_write_buffer_byte[7] = scnt & 0xff;
	//		FLASH_MEMORY_WRITE_BYTE_ARRAY(flash_address_write, flash_write_buffer_byte, 8); // cca 20-40 us?
	//		flash_address_write = flash_address_write + 8;
	//		k_msleep(1);
	//
	//	}

	int handle = 0;
	int ret = 0;

	nrfx_timer_t timer_inst = NRFX_TIMER_INSTANCE(TIMER_INST_IDX);
	uint32_t base_frequency = NRF_TIMER_BASE_FREQUENCY_GET(timer_inst.p_reg);
	nrfx_timer_config_t config = NRFX_TIMER_DEFAULT_CONFIG(base_frequency);
	config.bit_width = NRF_TIMER_BIT_WIDTH_32;
	config.p_context = "Some context";
	// config.interrupt_priority=20;

	status = nrfx_timer_init(&timer_inst, &config, timer_handler);
	NRFX_ASSERT(status == NRFX_SUCCESS);

	nrfx_timer_clear(&timer_inst);
	uint32_t desired_ticks = nrfx_timer_us_to_ticks(&timer_inst, TIME_TO_WAIT_US);
	nrfx_timer_extended_compare(&timer_inst, NRF_TIMER_CC_CHANNEL0, desired_ticks,
								NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

	k_sleep(K_MSEC(500));

	// printk("\nSAMPLE APP STARTS\n");

